1c/configuration/InformationRegisters/ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛК_ОчередьОбменаСЛКПроизвольнымиДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛК_СтатусОбменаСЛК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипОбъкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛК_ВидыСобытийСОбъектамиЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХЭШ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/configuration/Enums/ЛК_СтатусОбменаСЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЛК_СтатусОбменаСЛК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c/configuration/InformationRegisters/ЛК_ОчередьОбменаСЛКПроизвольнымиДанными/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

#Область РегистрацияДанных

Процедура ЗарегистрироватьДобавлениеОбъекта(ТипОбъкта, ИмяОбъекта, ХЭШ, Данные) Экспорт 
	
	МенеджерЗаписи             = РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипОбъкта   = ТипОбъкта;
	МенеджерЗаписи.ВидСобытия  = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Добавление;
	МенеджерЗаписи.ХЭШ         = ХЭШ;
	МенеджерЗаписи.Статус      = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.Данные      = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.ИмяОбъекта  = ИмяОбъекта;
	
	Попытка
		МенеджерЗаписи.Записать();
		
		ЛК_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,	
											ЛК_ЛогированиеСервер.ДанныеJSONОбъектJSON(ЛК_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
																				ЛК_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТипОбъкта,
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьДобавлениеОбъекта"));

	Исключение
		ЛК_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ЛК_ЛогированиеСервер.ДанныеJSONОбъектJSON(ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ЛК_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТипОбъкта,
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьДобавлениеОбъекта",
																				ОписаниеОшибки()));
	КонецПопытки;

КонецПроцедуры

Процедура ЗарегистрироватьИзменениеОбъекта(ТипОбъкта, ИмяОбъекта, ХЭШ, Данные) Экспорт 
	
	МенеджерЗаписи             = РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипОбъкта    = ТипОбъкта;
	МенеджерЗаписи.ВидСобытия  = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.ХЭШ         = ХЭШ;
	МенеджерЗаписи.Статус      = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.Данные      = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.ИмяОбъекта  = ИмяОбъекта;
	
	Попытка
		МенеджерЗаписи.Записать();

		ЛК_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,	
											ЛК_ЛогированиеСервер.ДанныеJSONОбъектJSON(ЛК_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
																				ЛК_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьИзменениеОбъекта"));
	Исключение
		ЛК_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ЛК_ЛогированиеСервер.ДанныеJSONОбъектJSON(ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ЛК_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьИзменениеОбъекта",
																				ОписаниеОшибки()));
	КонецПопытки;
		
КонецПроцедуры

Процедура ЗарегистрироватьУдалениеОбъекта(ТипОбъкта, ИмяОбъекта, ХЭШ, Данные) Экспорт 
	
	МенеджерЗаписи             = РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипОбъкта    = ТипОбъкта;
	МенеджерЗаписи.ВидСобытия  = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Удаление;
	МенеджерЗаписи.ХЭШ         = ХЭШ;
	МенеджерЗаписи.Статус      = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.Данные      = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.ИмяОбъекта  = ИмяОбъекта;
	
	Попытка	
		МенеджерЗаписи.Записать();
		
		ЛК_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,	
											ЛК_ЛогированиеСервер.ДанныеJSONОбъектJSON(ЛК_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
																				ЛК_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьУдалениеОбъекта"));
	Исключение
		ЛК_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ЛК_ЛогированиеСервер.ДанныеJSONОбъектJSON(ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ЛК_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьУдалениеОбъекта",
																				ОписаниеОшибки()));
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти

#Область ИзменениеСтатуса

Процедура ЗарегистрироватьОшибкуОбработки(ИД, ТипОбъкта, ИмяОбъекта, ВидСобытия, ХЭШ, Данные, МестоВозникновения = "", Ошибка = "") Экспорт 
	
	МенеджерЗаписи             = РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипОбъкта    = ТипОбъкта;
	МенеджерЗаписи.ВидСобытия  = ВидСобытия;
	МенеджерЗаписи.ХЭШ         = ХЭШ;
	МенеджерЗаписи.Статус      = Перечисления.ЛК_СтатусОбменаСЛК.Ошибка;
	МенеджерЗаписи.Данные      = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.ИД          = ИД;
	МенеджерЗаписи.ИмяОбъекта  = ИмяОбъекта;

	Попытка
		МенеджерЗаписи.Записать();
		
		ЛК_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ЛК_ЛогированиеСервер.ДанныеJSONОбъектJSON(ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ЛК_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				МестоВозникновения,
																				Ошибка));
	Исключение
		ЛК_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ЛК_ЛогированиеСервер.ДанныеJSONОбъектJSON(ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ЛК_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТипОбъкта,
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьОшибкуОбработки",
																				ОписаниеОшибки()));
	КонецПопытки;
		
КонецПроцедуры

Процедура ЗарегистрироватьУспехОбработки(ИД, ТипОбъкта, ИмяОбъекта, ВидСобытия, ХЭШ, Данные) Экспорт 
	
	МенеджерЗаписи             = РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипОбъкта    = ТипОбъкта;
	МенеджерЗаписи.ВидСобытия  = ВидСобытия;
	МенеджерЗаписи.ХЭШ         = ХЭШ;
	МенеджерЗаписи.Статус      = Перечисления.ЛК_СтатусОбменаСЛК.Выполнен;
	МенеджерЗаписи.Данные      = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.ИД		   = ИД;
	МенеджерЗаписи.ИмяОбъекта  = ИмяОбъекта;

	Попытка	
		МенеджерЗаписи.Записать();
		
		ЛК_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,	
											ЛК_ЛогированиеСервер.ДанныеJSONОбъектJSON(ЛК_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
																				ЛК_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьУдалениеОбъекта"));	
	Исключение
		ЛК_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,			
											ЛК_ЛогированиеСервер.ДанныеJSONОбъектJSON(ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ЛК_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТипОбъкта, 
																				ИмяОбъекта,
																				Данные, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.ЗарегистрироватьУспехОбработки",
																				ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
